Repository: BrianNjau/iOS-Demo-AppCube
Catalog: MacleProducts/MacleResource/*.lproj/Localizable.strings
Languages: am, my_mm, ur

source: Cancel
am: ይቅር
my_mm: ပယ်ဖျက်မည်
ur: منسوخ کریں

# confirm
source: OK
am: እሺ
my_mm: အိုကေ
ur: ٹھیک ہے

source: Done
am: ተከናውኗል
my_mm: ပြီးပြီ
ur: ہو گیا

# notice
source: Note
am: ማስታወሻ
my_mm: မှတ်ချက်
ur: نوٹ

source: Loading
am: በመጫን ላይ
my_mm: လုပ်ဆောင်နေပါသည်
ur: لوڈ ہو رہا ہے

# sub_pkg_loading
source: Loading
am: በመጫን ላይ
my_mm: လုပ်ဆောင်နေပါသည်
ur: لوڈ ہو رہا ہے

# cameraError
source: Camera cannot be accessed due to system settings.
am: በስርዓት ቅንብሮች ምክንያት ካሜራ ሊደረስበት አይችልም።
my_mm: စနစ်ဆက်တင်များကြောင့် ကင်မရာကို ဝင်ရောက်သုံးစွဲ၍မရပါ။
ur: سسٹم کی ترتیبات کی وجہ سے کیمرہ تک رسائی حاصل نہیں کی جا سکتی۔

# photosError
source: Photos cannot be accessed due to system settings.
am: በስርዓት ቅንብሮች ምክንያት ፎቶዎች ሊደረስበት አይችልም።
my_mm: စနစ်ဆက်တင်များကြောင့် ဓာတ်ပုံများကို ဝင်ရောက်သုံးစွဲ၍မရပါ။
ur: سسٹم کی ترتیبات کی وجہ سے تصاویر تک رسائی حاصل نہیں کی جا سکتی۔

# selectQRNotice
source: Touch the blue dot to select the QR code.
am: QR ኮዱን ለመምረጥ ሰማያዊ ነጥቡን ይንኩ።
my_mm: QR ကုဒ်ကို ရွေးချယ်ရန် အပြာရောင်အစက်ကို နှိပ်ပါ။
ur: QR کوڈ کو منتخب کرنے کے لیے نیلے نقطے کو چھوئیں۔

# allowCameraAccess
source: [Go to: Settings > Privacy & Security > Camera > %@] Allow the Mini Program to access Camera.
am: [ሂድ ወደ፦ ቅንብሮች > ግላዊነት እና ደህንነት > ካሜራ > %@] ሚኒ ፕሮግራም ካሜራን እንዲደርስበት ፍቀድ።
my_mm: [သွားပါ- ဆက်တင် > ကိုယ်ရေးလုံခြုံမှုနှင့် လုံခြုံရေး > ကင်မရာ > %@] မီနီပရိုဂရမ်အား ကင်မရာအသုံးပြုခွင့်ပေးရန်။
ur: [مندرجہ ذیل پر جائیں: ترتیبات > رازداری اور سکیورٹی > کیمرہ > %@] منی پروگرام کو کیمرہ تک رسائی حاصل کرنے کی اجازت دیں۔

# allowPhotosAccess
source: [Go to: Settings > Privacy & Security > Photos > %@] Allow the Mini Program to access Photos.
am: [ሂድ ወደ፦ ቅንብሮች > ግላዊነት እና ደህንነት > ፎቶዎች > %@] ሚኒ ፕሮግራም ፎቶዎችን እንዲደርስበት ፍቀድ።
my_mm: [သွားပါ- ဆက်တင် > ကိုယ်ရေးလုံခြုံမှုနှင့် လုံခြုံရေး > ဓာတ်ပုံများ > %@] မီနီပရိုဂရမ်အား ဓာတ်ပုံများအသုံးပြုခွင့်ပေးရန်။
ur: [مندرجہ ذیل پر جائیں: ترتیبات > رازداری اور سکیورٹی > تصاویر > %@] منی پروگرام کو تصاویر تک رسائی حاصل کرنے کی اجازت دیں۔

# takePhoto
source: Take a Photo
am: ፎቶ አንሳ
my_mm: ဓာတ်ပုံရိုက်မည်
ur: ایک تصویر کھینچیں

source: Select from Gallery
am: ከፎቶዎች ምረጥ
my_mm: ဓာတ်ပုံများမှ ရွေးချယ်မည်
ur: تصاویر میں سے منتخب کریں

# makePhoneCall_call
source: Call
am: ደውል
my_mm: ဖုန်းခေါ်မည်
ur: کال کریں

# menu_rating
source: Rating
am: የተሰጠው ደረጃ
my_mm: အဆင့်
ur: درجہ بندی

# menu_reload
source: Restart
am: ዳግም አስነሳ
ur: ری اسٹارٹ کریں

# menu_settings
source: Settings
am: ቅንብሮች
ur: ترتیبات

# rating_comment
source: Comment
am: አሰተያየት ስጥ
my_mm: ထင်မြင်ချက်
ur: تبصرہ

# rating_comment_placeholder
source: Your suggestions will help us serve you better in the future.
am: የእርስዎ ጥቆማዎች ለወደፊት በተሻለ ሁኔታ እንድናገለግለዎት ያስችሉናል።
my_mm: သင်၏ အကြံပြုချက်များသည် နောင်တွင် သင့်အား ပိုမိုကောင်းမွန်စွာ ဝန်ဆောင်မှုပေးနိုင်ရန် ကျွန်ုပ်တို့ကို ကူညီပါမည်။
ur: آپ کی تجاویز مستقبل میں آپ کی بہتر خدمت کرنے میں ہماری مدد کریں گی۔

# rating_submit
source: Submit
am: አስገባ
my_mm: ပေးပို့မည်
ur: جمع کروائیں

# rating_submit_success
source: Rating succeeded.
am: ደረጃ መስጠት ተሳክቷል።
my_mm: အဆင့်သတ်မှတ်ခြင်း အောင်မြင်သည်။
ur: درجہ بندی کامیاب ہو گئی۔

# rating_submit_fail
source: Rating failed. Please try again.
am: ደረጃ መስጠት አልተሳካም። እባክዎ እንደገና ይሞክሩ።
my_mm: အဆင့်သတ်မှတ်ခြင်း မအောင်မြင်ပါ။ ထပ်မံကြိုးစားပေးပါ။
ur: درجہ بندی ناکام ہو گئی۔ برام کرم دوبارہ کوشش کریں۔

# auth_location_name
source: Location
am: አካባቢ
my_mm: တည်နေရာ
ur: مقام

# auth_location_desc
source: Your Location will be obtained.
am: የእርስዎ አካባቢ ይገኛል።
my_mm: သင့်တည်နေရာကို ရယူပါမည်။
ur: آپ کا مقام حاصل کیا جائے گا۔

# auth_camera_name
source: Camera
am: ካሜራ
my_mm: ကင်မရာ
ur: کیمرہ

# auth_camera_desc
source: Your Camera will be accessed.
am: የእርስዎ ካሜራ ይደረስበታል።
my_mm: သင့်ကင်မရာကို ဝင်ရောက်သုံးစွဲပါမည်။
ur: آپ کے کیمرہ تک رسائی حاصل کی جائے گی۔

# auth_photoAlbums_name
source: Photos
am: ፎቶዎች
my_mm: ဓာတ်ပုံများ
ur: تصاویر

# auth_photoAlbums_desc
source: Your Photos will be read/written.
am: የእርስዎ ፎቶዎች ይነበባል/ይጻፍበታል።
my_mm: သင့်ဓာတ်ပုံများကို ဖတ်/ရေးပါမည်။
ur: آپ کی تصاویر پڑھی/لکھی جائیں گی۔

# auth_contacts_name
source: Contacts
am: እውቂያዎች
my_mm: အဆက်အသွယ်
ur: رابطے

# auth_contacts_desc
source: Your Contacts will be accessed.
am: የእርስዎ እውቂያዎች ይደረስበታል።
my_mm: သင့်အဆက်အသွယ်ကို ဝင်ရောက်သုံးစွဲပါမည်။
ur: آپ کے رابطے تک رسائی حاصل کی جائے گی۔

# auth_record_name
source: Microphone
am: ማይክሮፎን
my_mm: ဖုန်း
ur: مائیکروفون

# auth_record_desc
source: Your Microphone will be accessed.
am: ማይክሮፎንዎያገለግላል
my_mm: သင့်ဖုန်းဖြင့်အသုံးပြုခွင့်ရရှိပါသည်။
ur: آپ کے مائیکروفون تک رسائی حاصل کی جائے گی.

# auth_your_authority
source: your %@
am: %@ ላይ ይተገበራል
my_mm: %@နှင့် သက်ဆိုင်သည်
ur: پر لاگو ہوتی ہے %@

# auth_apply
source: applies for
am: በእርስዎ
my_mm: သည် သင့်
ur: کی آپ

# auth_deny
source: Reject
am: አትቀበል
my_mm: ငြင်းပယ်မည်
ur: مسترد کریں

# auth_allow
source: Allow
am: ፍቀድ
my_mm: ခွင့်ပြုမည်
ur: اجازت دیں

# auth_setting_note
source: Allow "%@" to use
am: %@ እነዚህን እንዲጠቀም ፍቀድለት፦
my_mm: %@ အား သုံးခွင့်ပြုရန်
ur: ‏%@ کو استعمال کرنے کی اجازت دیں

# autu_empty
source: No permission usage record found.
am: ምንም የፈቃድ አጠቃቀም መዝገብ አልተገኘም።
my_mm: ခွင့်ပြုချက်အသုံးပြုမှုမှတ်တမ်းကို မတွေ့ပါ။
ur: اجازت کے استعمال کا کوئی ریکارڈ نہیں ملا۔

# auth_desc
source: User Authorization
am: የተጠቃሚ ፍቃድ
my_mm: အသုံးပြုသူခွင့်ပြုချက်
ur: صارف کی اجازت

# auth_requst_info
source: "%@" request following information
am: "%@" የሚከተለውን መረጃ ይጠይቁ
my_mm: "%@" အောက်ပါအချက်အလက်များကိုတောင်းဆိုပါ။
ur: "%@" مندرجہ ذیل معلومات کی درخواست کریں

# app_detail_go_2_mini_app
source: Go to Mini App
am: ወደ ሚኒ መተግበሪያ ይሂዱ
my_mm: Mini App သို့သွားပါ။
ur: مینی ایپ پر جائیں

# app_detail_dev_team
source: Development team
am: አበልፃጊ ቡድን
ur: ترقی کی ٹیم

# app_detail_more_infos
source: More information
am: ተጨማሪ መረጃ
my_mm: အချက်အလက်များ
ur: مزید معلومات

# app_detail_basic_info
source: Basic information
am: መሰረታዊ መረጃ
my_mm: အခြေခံအချက်အလက်
ur: بنیادی معلومات

# app_detail_developer
source: Developer
am: አበልፃጊ
my_mm: ဆော့ဝဲဖ် အင်ဂျင်နီယာ
ur: ڈیولپر

# app_detail_update_time
source: Update time
am: የዘመነበት ጊዜ
my_mm: Update အချိန်
ur: اپ ڈیٹ وقت

# app_detail_register_time
source: Register time
am: የመመዝገቢያ ጊዜ
my_mm: မှတ်ပုံတင်အချိန်
ur: رجسٹر وقت

# app_detail_terms_of_services
source: Terms of Services
am: የአገልግሎት ደንብ
my_mm: ဝန်ဆောင်မှု စည်းမျဉ်းစည်းကမ်း
ur: خدمات کی شرائط

# app_detail_service_statement
source: Service Statement
am: የአገልግሎት መግለጫ
my_mm: ဝန်ဆောင်မှု ကြေငြာချက်
ur: سروس کا بیان

# app_detail_service_statement_detail
source: This service is provided by developers to Mini APP users. Developers are fully responsible for the authenticity, legality,and validity of the service information, data, and operations.Mini APP provides technical support services for developers.
am: ይህ አገልግሎት በአበልፃጊዎች ለሚኒ መተግበሪያ ተጠቃሚዎች የቀረበ ነው ። አበልፃጊው ለአገልግሎቱ መረጃ እና አሠራሮች ርግጠኝነት፣ ትክክለኛነት እና ህጋዊነት ሙሉ ኃላፊነት አለበት። ሚኒ መተግበሪያው ለአበልፃጊዎች የቴክኒክ ድጋፍ አገልግሎቶችን ይሰጣል።
my_mm: ဤဝန်ဆောင်မှုကို Mini APP အသုံးပြုသူများအတွက် ဆော့ဖ်ဝဲအင်ဂျင်နီယာများက ပံ့ပိုးပေးပါသည်။ ဆော့ဖ်ဝဲရေးသားသူများသည် ဝန်ဆောင်မှုအချက်အလက်များ၊ ဒေတာနှင့် လုပ်ငန်းဆောင်ရွက်မှုများ၏ စစ်မှန်မှု၊ တရားဝင်မှုနှင့် အကျုံးဝင်မှုတို့အတွက် အပြည့်အဝ တာဝန်ရှိပါသည်။ Mini APP သည် developer များအတွက် နည်းပညာပိုင်းဆိုင်ရာ ပံ့ပိုးမှုဝန်ဆောင်မှုများကို ပေးဆောင်ပါသည်။
ur: یہ سروس مینی اے پی پی صارفین کو ڈویلپرز کی طرف سے فراہم کی جاتی ہے. ڈویلپرز سروس کی معلومات، ڈیٹا، اور آپریشن کی صداقت، قانونی حیثیت، اور موزونیت کے لئے مکمل طور پر ذمہ دار ہیں. مینی اے پی پی ڈویلپرز کے لئے تکنیکی مدد کی خدمات فراہم کرتا ہے.
